import numpy as np

def sum_2x2_blocks(arr):
    # Проверяем размерность массива
    if arr.shape[0] % 2 != 0 or arr.shape[1] % 2 != 0:
        raise ValueError("Размер массива должен быть кратен 2 по обоим измерениям.")
    
    # Вычисляем количество блоков по каждому измерению
    num_blocks_row = arr.shape[0] // 2
    num_blocks_col = arr.shape[1] // 2
    
    # Создаем новый массив для хранения сумм каждого блока
    result = np.zeros((num_blocks_row, num_blocks_col))
    
    # Вычисляем сумму в каждом блоке 2x2
    for i in range(num_blocks_row):
        for j in range(num_blocks_col):
            block = arr[i*2:(i+1)*2, j*2:(j+1)*2]
            result[i, j] = np.sum(block)
    
    return result

# Создаем исходный двумерный массив
arr = np.array([[0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0],
                [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0],
                [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
                [0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1],
                [0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0],
                [0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1],
                [0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0],
                [0, 1, 0, 0, 1, 1, 1, 1, 0, 1, 1, 1, 0, 0],
                [1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0]])

# Вызываем функцию для вычисления суммы в каждой ячейке 2x2
result = sum_2x2_blocks(arr)
print(result)